Construction/transonic_WORKING/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    upper
    {
        type            wall;
        inGroups        1(wall);
        nFaces          150;
        startFace       39600;
    }
    lower
    {
        type            wall;
        inGroups        1(wall);
        nFaces          150;
        startFace       39750;
    }
    inlet
    {
        type            patch;
        inGroups        1(freestream);
        nFaces          400;
        startFace       39900;
    }
    outlet
    {
        type            patch;
        inGroups        1(freestream);
        nFaces          100;
        startFace       40300;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          20000;
        startFace       40400;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          20000;
        startFace       60400;
    }
)

// ************************************************************************* //
