Construction/transonic_WORKING/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    upper
    {
        type            calculated;
        value           nonuniform List<vector> 
150
(
(-21.595713 0 -2.0779758)
(-21.750411 0 -2.1210832)
(-21.901807 -1.9389001e-20 -2.1648237)
(-22.049849 0 -2.2088965)
(-22.194556 4.51385e-20 -2.2533233)
(-22.335866 0 -2.2982995)
(-22.473704 0 -2.3436896)
(-22.608147 5.6006955e-20 -2.3894317)
...
)
;
    }
    lower
        {
            type            calculated;
            value           nonuniform List<vector>
    150
    (
    (-21.593925 0 -2.0530499)
    (-21.744528 0 -2.0390736)
    (-21.891686 -1.4784384e-20 -2.0237389)
    (-22.035389 0 -2.0073364)
    (-22.175655 2.7173395e-20 -1.9898438)
    (-22.312389 0 -1.9710429)
    (-22.445538 0 -1.9510526)
    (-22.575185 2.2554717e-20 -1.9299461)
...
    );
    }

    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
