Construction/transonic_WORKING/system/samplePwall
type            surfaceFieldValue;
libs            ("libfieldFunctionObjects.so");

writeControl    writeTime;
writeFields     true;

surfaceFormat   raw;
regionType      patch;
name            upper;

operation       none;

fields
(
    p
    yPlus
    wallShearStress
);
